<a href="https://colab.research.google.com/github/DebjitHore/PadhAI_FDS/blob/master/Python_PandasforGrandpa_CourseNotes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.1.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [2]:
import pandas as pd
import numpy as np

In [3]:
x= pd.Series([1,2,3,4,5,6,7])

In [4]:
print(x)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

First column represents the series index. Homogenous data type, like numpy arrays

In [5]:
x.dtype

dtype('int64')

In [6]:
x.values #deprecated, don't do

array([1, 2, 3, 4, 5, 6, 7])

In [7]:
x.head() #first five values

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
x.tail() #last five values

2    3
3    4
4    5
5    6
6    7
dtype: int64

In [9]:
x.head(3)

0    1
1    2
2    3
dtype: int64

In [10]:
data= {'a': 0.,  'b':1., 'c':2., 'd':3.}
y=pd.Series(data)
y #Dictionary key used as index

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [11]:
z= pd.Series(['Debjit', 'DebjitAgain'])
z

0         Debjit
1    DebjitAgain
dtype: object

In [12]:
xx= np.array([10,20,30,40])
pd.Series(xx)

0    10
1    20
2    30
3    40
dtype: int64

In [13]:
pd.Series(np.random.normal(size=5))

0    1.250209
1   -0.852915
2   -0.574990
3    1.097541
4   -1.071601
dtype: float64

In [14]:
x

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

# Pandas Series Indexing

In [15]:
x[1] #Actually returns the value of series at index labelled 3, not necessarily 3rd index. Indices in a pandas series can be modified check next cell

2

In [16]:
x.index= [6, 5, 4, 3, 2, 1, 0]
x

6    1
5    2
4    3
3    4
2    5
1    6
0    7
dtype: int64

In [17]:
x[1] #Acessing via index labels

6

In [18]:
x.iloc[1] #Accessing via index positions

2

In [19]:
x.iloc[-1]

7

In [20]:
x.iloc[1:4:2]

5    2
3    4
dtype: int64

In [21]:
grades= pd.Series([88, 89, 92, 94, 100, 75])
grades.index= ['Debjit', 'Kapas', 'Shubhro', 'Sita', 'Durbadal', 'Mahato']

In [22]:
grades[0] #Actually returns series value at index 0 since the labels are STRINGS

88

In [23]:
grades['Debjit']

88

In [24]:
grades.iloc[0]

88

In [25]:
grades.loc['Debjit']

88

In [26]:
grades.loc[
          'Debjit'
          :
           'Sita'
]

Debjit     88
Kapas      89
Shubhro    92
Sita       94
dtype: int64

In [27]:
xy= pd.Series(np.random.normal(size=10**7))
print(xy.index) #Range of indices is returned

RangeIndex(start=0, stop=10000000, step=1)

In [28]:
A= pd.Series([1,2,3,4,5])
A

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [29]:
A+1 #Broadcasting

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [30]:
A+ pd.Series(1) #Index alignment

0    2.0
1    NaN
2    NaN
3    NaN
4    NaN
dtype: float64

In [31]:
pd.Series(1)

0    1
dtype: int64

In [32]:
B=pd.Series(np.arange(10, 60, 10))
C= pd.Series(np.arange(1,6,1))
print(B, '\n', C)

0    10
1    20
2    30
3    40
4    50
dtype: int64
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [33]:
B+C

0    11
1    22
2    33
3    44
4    55
dtype: int64

Addition also happens by index labels, not index positions which can be seen by reversing the order of index labels

In [34]:
B.index= [4,3,2,1,0]
B+C

0    51
1    42
2    33
3    24
4    15
dtype: int64

In [35]:
#Index based addition can be done by changing the series to numpy arrays and converting them back to a series
pd.Series(B.to_numpy()+C.to_numpy())

0    11
1    22
2    33
3    44
4    55
dtype: int64

# Boolean Indexing

In [36]:
foo= pd.Series([20, 15, 37, 22, 12, 9, 71, 31])

In [37]:
mask =foo<20

In [38]:
foo.loc[mask]

1    15
4    12
5     9
dtype: int64

In [39]:
foo.loc[mask.to_numpy()] #Use this

1    15
4    12
5     9
dtype: int64

In [40]:
age= pd.Series(
    data= [18, 22, 15, 35, 50],
    index= ['Chris', 'Ana', 'Peter', 'Lewie', 'Matilda'],
    dtype= 'int64'
)

In [41]:
genders= pd.Series(
    data= ['female', 'male', 'female', 'male', 'male'],
    index= ['Ana', 'Chris', 'Matilda', 'Peter', 'Lewie'],
    dtype='string'
)

In [42]:
#who's a male below 18 years of age?
mask= (genders== 'male') & (age<18)
mask

Ana        False
Chris      False
Lewie      False
Matilda    False
Peter       True
dtype: bool

In [43]:
mask.loc[mask.to_numpy()]

Peter    True
dtype: bool

In [44]:
~mask

Ana         True
Chris       True
Lewie       True
Matilda     True
Peter      False
dtype: bool

Wrap each individual condition in brackets for the interpretor

# Series Missing Values

In [45]:
roux= pd.Series([1,2,3], dtype= 'Int64')
roux

0    1
1    2
2    3
dtype: Int64

In [46]:
roux.iloc[1]=np.nan #OR pd.NA
roux

0       1
1    <NA>
2       3
dtype: Int64

In [47]:
pd.isna(roux)

0    False
1     True
2    False
dtype: bool

In [48]:
pd.notna(roux)

0     True
1    False
2     True
dtype: bool

In [49]:
roux.fillna(-1)  #Returns a modified value of roux, without actually changing the series

0     1
1    -1
2     3
dtype: Int64

In [50]:
roux

0       1
1    <NA>
2       3
dtype: Int64

In [51]:
roux.fillna(-1, inplace=True) #Changes the original
roux

0     1
1    -1
2     3
dtype: Int64

In [52]:
goo= pd.Series([10, 20, 30, 50])
goo

0    10
1    20
2    30
3    50
dtype: int64

In [53]:
choo= pd.Series([True, False, pd.NA, True])
choo
#Notice the dtype is object

0     True
1    False
2     <NA>
3     True
dtype: object

In [54]:
#goo.loc[choo] ; This will throw an error

In [55]:
choo= pd.Series([True, False, pd.NA, True], dtype='boolean')
choo
#Doing this takes care of the nan value

0     True
1    False
2     <NA>
3     True
dtype: boolean

In [56]:
goo.loc[choo]
#goo[choo]

0    10
3    50
dtype: int64

# Series Vectorisation

In [57]:
x= pd.Series(np.random.normal(size=10**6))
x.mean()

-0.0024972615707805315

# Functions available in Series

In [58]:
foo= pd.Series([3,8,9,1,2,7])
foo

0    3
1    8
2    9
3    1
4    2
5    7
dtype: int64

In [59]:
def my_fun(x):
  return x-1 if x%2 == 0 else x+3

In [60]:
foo.apply(my_fun)

0     6
1     7
2    12
3     4
4     1
5    10
dtype: int64

In [61]:
zoo= pd.Series(['lion', 'tiger','zebra','lion'])
zoo

0     lion
1    tiger
2    zebra
3     lion
dtype: object

In [62]:
new_zoo= zoo.replace({'lion':'hamster'})
new_zoo #creates a copy of zoo and does not assign by reference even if it were not assigned to a new variable

0    hamster
1      tiger
2      zebra
3    hamster
dtype: object

# Challenges: Baby Names

In [63]:
babynames= pd.Series(['Jato', 'Zeltron', 'Ruger', 'Phreddy', 'Ruger', 'Chad', 'Chad', 'Ruger', 'Ryan', 'Chad','Phreddy','Phreddy', 'Phreddy', 'Jato', 'Jato', 'Zeltron'], dtype='string')

In [64]:
mask= (babynames=='Chad') | (babynames == 'Zeltron')| (babynames=='Ruger')

In [65]:
count_of_people_who_voted_these_names= babynames[mask].count()
count_of_people_who_voted_these_names

8

# Dataframe Creation

In [66]:
df= pd.DataFrame({'name': ['Bob', 'Sue', 'Mary'], 'age': [39, 57,21]})
df

   name  age
0   Bob   39
1   Sue   57
2  Mary   21

In [67]:
#Dataframe from a list of lists
df= pd.DataFrame([
    ['Bob',40],
    ['Sue',58],
    ['Mary',22]
], columns= ['name', 'age'])
df

   name  age
0   Bob   40
1   Sue   58
2  Mary   22

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [69]:
df.shape

(3, 2)

In [70]:
df.axes

[RangeIndex(start=0, stop=3, step=1), Index(['name', 'age'], dtype='object')]

In [71]:
df.size

6

In [72]:
df.rename(columns={'age':'years'}, inplace=True)
df

   name  years
0   Bob     40
1   Sue     58
2  Mary     22

In [73]:
df= pd.DataFrame({
    'ID' : np.arange(1000),
    'b': np.random.normal(1000),
    'c': pd.Series(np.random.choice(['cat', 'dog', 'hippo'], size=1000, replace=True))
})
df

      ID           b      c
0      0  999.237088    cat
1      1  999.237088  hippo
2      2  999.237088    dog
3      3  999.237088    dog
4      4  999.237088  hippo
..   ...         ...    ...
995  995  999.237088    cat
996  996  999.237088    dog
997  997  999.237088    dog
998  998  999.237088    dog
999  999  999.237088  hippo

[1000 rows x 3 columns]

In [74]:
df.to_csv("Pets.CSV", index= False)

In [75]:
Pets= pd.read_csv("Pets.CSV")
Pets

      ID           b      c
0      0  999.237088    cat
1      1  999.237088  hippo
2      2  999.237088    dog
3      3  999.237088    dog
4      4  999.237088  hippo
..   ...         ...    ...
995  995  999.237088    cat
996  996  999.237088    dog
997  997  999.237088    dog
998  998  999.237088    dog
999  999  999.237088  hippo

[1000 rows x 3 columns]

# DataFrame Indexing

In [76]:
df.b #Dot Notation

0      999.237088
1      999.237088
2      999.237088
3      999.237088
4      999.237088
          ...
995    999.237088
996    999.237088
997    999.237088
998    999.237088
999    999.237088
Name: b, Length: 1000, dtype: float64

In [77]:
df['b'] #Useful if the column names have spaces

0      999.237088
1      999.237088
2      999.237088
3      999.237088
4      999.237088
          ...
995    999.237088
996    999.237088
997    999.237088
998    999.237088
999    999.237088
Name: b, Length: 1000, dtype: float64

In [78]:
df[['b', 'c']] #List of column names is returned

              b      c
0    999.237088    cat
1    999.237088  hippo
2    999.237088    dog
3    999.237088    dog
4    999.237088  hippo
..          ...    ...
995  999.237088    cat
996  999.237088    dog
997  999.237088    dog
998  999.237088    dog
999  999.237088  hippo

[1000 rows x 2 columns]

In [79]:
df.iloc[[0,2,4]]

   ID           b      c
0   0  999.237088    cat
2   2  999.237088    dog
4   4  999.237088  hippo

In [80]:
df[0:5:2]

   ID           b      c
0   0  999.237088    cat
2   2  999.237088    dog
4   4  999.237088  hippo

In [81]:
df.iloc[:, [1,2]]  #All rows of columns 1 and 2

              b      c
0    999.237088    cat
1    999.237088  hippo
2    999.237088    dog
3    999.237088    dog
4    999.237088  hippo
..          ...    ...
995  999.237088    cat
996  999.237088    dog
997  999.237088    dog
998  999.237088    dog
999  999.237088  hippo

[1000 rows x 2 columns]

In [82]:
df.iloc[[0,1,5,6], [1,2]]

            b      c
0  999.237088    cat
1  999.237088  hippo
5  999.237088    dog
6  999.237088    cat

In [83]:
#iloc can only take index values not string column names
df.iloc[:12, [df.columns.get_loc(c) for c in ['b', 'c']]]

             b      c
0   999.237088    cat
1   999.237088  hippo
2   999.237088    dog
3   999.237088    dog
4   999.237088  hippo
5   999.237088    dog
6   999.237088    cat
7   999.237088    cat
8   999.237088  hippo
9   999.237088    dog
10  999.237088    dog
11  999.237088    dog

In [84]:
mask= df.c == 'cat'
mask

0       True
1      False
2      False
3      False
4      False
       ...
995     True
996    False
997    False
998    False
999    False
Name: c, Length: 1000, dtype: bool

In [85]:
df[mask]

      ID           b    c
0      0  999.237088  cat
6      6  999.237088  cat
7      7  999.237088  cat
13    13  999.237088  cat
16    16  999.237088  cat
..   ...         ...  ...
982  982  999.237088  cat
986  986  999.237088  cat
989  989  999.237088  cat
993  993  999.237088  cat
995  995  999.237088  cat

[358 rows x 3 columns]

In [86]:
df.loc[mask]

      ID           b    c
0      0  999.237088  cat
6      6  999.237088  cat
7      7  999.237088  cat
13    13  999.237088  cat
16    16  999.237088  cat
..   ...         ...  ...
982  982  999.237088  cat
986  986  999.237088  cat
989  989  999.237088  cat
993  993  999.237088  cat
995  995  999.237088  cat

[358 rows x 3 columns]

# Basic DataFrame Operations

In [87]:
new_df= df.iloc[0:5]
new_df

   ID           b      c
0   0  999.237088    cat
1   1  999.237088  hippo
2   2  999.237088    dog
3   3  999.237088    dog
4   4  999.237088  hippo

New Column Insertion

In [88]:
new_df['a']= [0,1,2,3,4]
new_df

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

   ID           b      c  a
0   0  999.237088    cat  0
1   1  999.237088  hippo  1
2   2  999.237088    dog  2
3   3  999.237088    dog  3
4   4  999.237088  hippo  4

In [89]:
new_df['sum column']=new_df.a+new_df.a
new_df

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

   ID           b      c  a  sum column
0   0  999.237088    cat  0           0
1   1  999.237088  hippo  1           2
2   2  999.237088    dog  2           4
3   3  999.237088    dog  3           6
4   4  999.237088  hippo  4           8

In [90]:
new_df.loc[new_df.c == 'cat', 'insertion through booleanindexing']= 0
new_df

/usr/local/lib/python3.7/dist-packages/pandas/core/indexing.py:1596: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = _infer_fill_value(value)
/usr/local/lib/python3.7/dist-packages/pandas/core/indexing.py:1763: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(loc, value)

   ID           b      c  a  sum column  insertion through booleanindexing
0   0  999.237088    cat  0           0                                0.0
1   1  999.237088  hippo  1           2                                NaN
2   2  999.237088    dog  2           4                                NaN
3   3  999.237088    dog  3           6                                NaN
4   4  999.237088  hippo  4           8                                NaN

Deleting columns

In [91]:
new_df.drop(columns= ['a', 'sum column'], inplace=True )
new_df

/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:4174: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

   ID           b      c  insertion through booleanindexing
0   0  999.237088    cat                                0.0
1   1  999.237088  hippo                                NaN
2   2  999.237088    dog                                NaN
3   3  999.237088    dog                                NaN
4   4  999.237088  hippo                                NaN

In [92]:
#.apply method

In [93]:
kids= pd.DataFrame({
    'Name': ['Alice', 'Mary', 'Jimmy', 'Johnny', 'Susan' ],
    'Age':[ 9,13, 11,15,8],
    'with_adult': [True, False, False, True, True]
})
#Only allowed on ride if above 12 or with adult

In [94]:
def is_allowed(age, with_adult):
  return age>12 or with_adult

In [95]:
kids.apply(lambda row: is_allowed(row.Age, row.with_adult), axis=1)

0     True
1     True
2    False
3     True
4     True
dtype: bool

In [96]:
kids['Is Allowed']= kids.apply(lambda row: is_allowed(row.Age, row.with_adult), axis=1)
kids

     Name  Age  with_adult  Is Allowed
0   Alice    9        True        True
1    Mary   13       False        True
2   Jimmy   11       False       False
3  Johnny   15        True        True
4   Susan    8        True        True

# Merge DataFrames

In [97]:
#Left, Right, Outer and Inner joins

In [98]:
pd.merge?

In [99]:
pets= pd.DataFrame(
    data= {
    'pets': ['Mr.Snuggles', 'Honey Chew Chew', 'Professor', 'Chairman Meow', 'Neighbelline'],
    'type': ['cat', 'dog', 'dog', 'cat', 'horse'],
    },
    index= [71, 42, 11, 98, 42]
)
print(pets)

               pets   type
71      Mr.Snuggles    cat
42  Honey Chew Chew    dog
11        Professor    dog
98    Chairman Meow    cat
42     Neighbelline  horse

In [101]:
visits= pd.DataFrame(
    data= {
        'pet_id': [42,31,71,42,98,42],
        'date': ['2019-03-15', '2019-03-15', '2019-04-05', '2019-04-06', '2019-04-12','2019-04-12'],
    }
)
visits

   pet_id        date
0      42  2019-03-15
1      31  2019-03-15
2      71  2019-04-05
3      42  2019-04-06
4      98  2019-04-12
5      42  2019-04-12

# Inner Join

In [103]:
pd.merge(left= pets, right= visits, how= 'inner', left_index= True, right_on='pet_id')

              pets   type  pet_id        date
2      Mr.Snuggles    cat      71  2019-04-05
0  Honey Chew Chew    dog      42  2019-03-15
3  Honey Chew Chew    dog      42  2019-04-06
5  Honey Chew Chew    dog      42  2019-04-12
0     Neighbelline  horse      42  2019-03-15
3     Neighbelline  horse      42  2019-04-06
5     Neighbelline  horse      42  2019-04-12
4    Chairman Meow    cat      98  2019-04-12

In [104]:
pets.index.rename('pet_id', inplace=True)
pets #Now we can join using the common index column

                   pets   type
pet_id
71          Mr.Snuggles    cat
42      Honey Chew Chew    dog
11            Professor    dog
98        Chairman Meow    cat
42         Neighbelline  horse

In [105]:
pd.merge(left= pets, right= visits, how= 'inner', on='pet_id')

   pet_id             pets   type        date
0      71      Mr.Snuggles    cat  2019-04-05
1      42  Honey Chew Chew    dog  2019-03-15
2      42  Honey Chew Chew    dog  2019-04-06
3      42  Honey Chew Chew    dog  2019-04-12
4      42     Neighbelline  horse  2019-03-15
5      42     Neighbelline  horse  2019-04-06
6      42     Neighbelline  horse  2019-04-12
7      98    Chairman Meow    cat  2019-04-12

# Left Join

In [107]:
pd.merge(left= pets, right= visits, how= 'left', on='pet_id')  #Records in pet tables that do not have matching values in the visits table are still included

   pet_id             pets   type        date
0      71      Mr.Snuggles    cat  2019-04-05
1      42  Honey Chew Chew    dog  2019-03-15
2      42  Honey Chew Chew    dog  2019-04-06
3      42  Honey Chew Chew    dog  2019-04-12
4      11        Professor    dog         NaN
5      98    Chairman Meow    cat  2019-04-12
6      42     Neighbelline  horse  2019-03-15
7      42     Neighbelline  horse  2019-04-06
8      42     Neighbelline  horse  2019-04-12

# Right join

In [108]:
pd.merge(left= pets, right= visits, how= 'right', on='pet_id')

   pet_id             pets   type        date
0      42  Honey Chew Chew    dog  2019-03-15
1      42     Neighbelline  horse  2019-03-15
2      42  Honey Chew Chew    dog  2019-04-06
3      42     Neighbelline  horse  2019-04-06
4      42  Honey Chew Chew    dog  2019-04-12
5      42     Neighbelline  horse  2019-04-12
6      31              NaN    NaN  2019-03-15
7      71      Mr.Snuggles    cat  2019-04-05
8      98    Chairman Meow    cat  2019-04-12

# Outer join

In [110]:
pd.merge(left= pets, right= visits, how= 'outer', on='pet_id')

   pet_id             pets   type        date
0      71      Mr.Snuggles    cat  2019-04-05
1      42  Honey Chew Chew    dog  2019-03-15
2      42  Honey Chew Chew    dog  2019-04-06
3      42  Honey Chew Chew    dog  2019-04-12
4      42     Neighbelline  horse  2019-03-15
5      42     Neighbelline  horse  2019-04-06
6      42     Neighbelline  horse  2019-04-12
7      11        Professor    dog         NaN
8      98    Chairman Meow    cat  2019-04-12
9      31              NaN    NaN  2019-03-15

# Anti Joins

In [119]:
#To check which entries in one table may or may not be present in the other
outer= pd.merge(left= pets, right= visits, how= 'outer', on='pet_id', indicator=True)
outer

   pet_id             pets   type        date      _merge
0      71      Mr.Snuggles    cat  2019-04-05        both
1      42  Honey Chew Chew    dog  2019-03-15        both
2      42  Honey Chew Chew    dog  2019-04-06        both
3      42  Honey Chew Chew    dog  2019-04-12        both
4      42     Neighbelline  horse  2019-03-15        both
5      42     Neighbelline  horse  2019-04-06        both
6      42     Neighbelline  horse  2019-04-12        both
7      11        Professor    dog         NaN   left_only
8      98    Chairman Meow    cat  2019-04-12        both
9      31              NaN    NaN  2019-03-15  right_only

In [120]:
in_left_not_in_right= outer.loc[outer._merge == 'left_only']

In [121]:
print(in_left_not_in_right)

   pet_id       pets type date     _merge
7      11  Professor  dog  NaN  left_only

In [122]:
#method 2 of achieving this
pets.index.isin(visits.pet_id)  #Which values of pets index are present in the pet_id column of visits table

array([ True,  True, False,  True,  True])

In [125]:
pets.loc[~pets.index.isin(visits.pet_id.unique())]

             pets type
pet_id
11      Professor  dog

# DataFrame Aggregation

In [126]:
df= pd.DataFrame(
    {
        'x': [5, 4, 2,6.7, 1.2, 4.5, 77, 12 ],
        'y' : [1.4, np.nan, 5.0, 5.8, 9.0, np.nan, 9.2, 1]
    }
)
df

      x    y
0   5.0  1.4
1   4.0  NaN
2   2.0  5.0
3   6.7  5.8
4   1.2  9.0
5   4.5  NaN
6  77.0  9.2
7  12.0  1.0

In [127]:
df.agg(np.sum)

x    112.4
y     31.4
dtype: float64

In [128]:
df.agg('sum') #looks for predefined pandas or numpy functions

x    112.4
y     31.4
dtype: float64

In [129]:
df.agg(['sum', 'mean'])

           x          y
sum   112.40  31.400000
mean   14.05   5.233333

In [131]:
def foofunc(x):
  return x.iloc[1]

df.agg(foofunc)  #For userdefined functions pass them as callable not strings

x    4.0
y    NaN
dtype: float64

In [135]:
df.agg({'x': ['sum', 'mean'], 'y': ['min', 'max']})

           x    y
max      NaN  9.2
mean   14.05  NaN
min      NaN  1.0
sum   112.40  NaN

# Group-By